{
  "Supreme Court of the United States": "U.S.",

  "United States Court of Appeals for the First Circuit": "1st Cir.",
  "United States Court of Appeals for the Second Circuit": "2d Cir.",
  "United States Court of Appeals for the Third Circuit": "3d Cir.",
  "United States Court of Appeals for the Fourth Circuit": "4th Cir.",
  "United States Court of Appeals for the Fifth Circuit": "5th Cir.",
  "United States Court of Appeals for the Sixth Circuit": "6th Cir.",
  "United States Court of Appeals for the Seventh Circuit": "7th Cir.",
  "United States Court of Appeals for the Eighth Circuit": "8th Cir.",
  "United States Court of Appeals for the Ninth Circuit": "9th Cir.",
  "United States Court of Appeals for the Tenth Circuit": "10th Cir.",
  "United States Court of Appeals for the Eleventh Circuit": "11th Cir.",
  "United States Court of Appeals for the District of Columbia Circuit": "D.C. Cir.",
  "United States Court of Appeals for the Federal Circuit": "Fed. Cir.",

  "United States District Court for the District of Alabama": "D. Ala.",
  "United States District Court for the Northern District of Alabama": "N.D. Ala.",
  "United States District Court for the Southern District of Alabama": "S.D. Ala.",
  "United States District Court for the Middle District of Alabama": "M.D. Ala.",
  "United States District Court for the District of Alaska": "D. Alaska",
  "United States District Court for the District of Arizona": "D. Ariz.",
  "United States District Court for the Western District of Arkansas": "W.D. Ark.",
  "United States District Court for the Eastern District of Arkansas": "E.D. Ark.",
  "United States District Court for the Northern District of California": "N.D. Cal.",
  "United States District Court for the Southern District of California": "S.D. Cal.",
  "United States District Court for the Central District of California": "C.D. Cal.",
  "United States District Court for the Eastern District of California": "E.D. Cal.",
  "United States District Court for the District of Colorado": "D. Colo.",
  "United States District Court for the District of Connecticut": "D. Conn.",
  "United States District Court for the District of Delaware": "D. Del.",
  "United States District Court for the District of the District of Columbia": "D.D.C.",
  "United States District Court for the Northern District of Florida": "N.D. Fla.",
  "United States District Court for the Southern District of Florida": "S.D. Fla.",
  "United States District Court for the Middle District of Florida": "M.D. Fla.",
  "United States District Court for the Northern District of Georgia": "N.D. Ga.",
  "United States District Court for the Southern District of Georgia": "S.D. Ga.",
  "United States District Court for the Middle District of Georgia": "M.D. Ga.",
  "United States District Court for the District of Hawaii": "D. Haw.",
  "United States District Court for the District of Idaho": "D. Idaho",
  "United States District Court for the Northern District of Illinois": "N.D. Ill.",
  "United States District Court for the Central District of Illinois": "C.D. Ill.",
  "United States District Court for the Northern District of Indiana": "N.D. Ind.",
  "United States District Court for the Southern District of Indiana": "S.D. Ind.",
  "United States District Court for the Northern District of Iowa": "N.D. Iowa",
  "United States District Court for the Southern District of Iowa": "S.D. Iowa",
  "United States District Court for the District of Kansas": "D. Kan.",
  "United States District Court for the Eastern District of Kentucky": "E.D. Ky.",
  "United States District Court for the Western District of Kentucky": "W.D. Ky.",
  "United States District Court for the Eastern District of Louisiana": "E.D. La.",
  "United States District Court for the Middle District of Louisiana": "M.D. La.",
  "United States District Court for the Western District of Louisiana": "W.D. La.",
  "United States District Court for the District of Maine": "D. Me.",
  "United States District Court for the District of Maryland": "D. Md.",
  "United States District Court for the District of Massachusetts": "D. Mass.",
  "United States District Court for the Eastern District of Michigan": "E.D. Mich.",
  "United States District Court for the Western District of Michigan": "W.D. Mich.",
  "United States District Court for the District of Minnesota": "D. Minn.",
  "United States District Court for the Northern District of Mississippi": "N.D. Miss.",
  "United States District Court for the Southern District of Mississippi": "S.D. Miss.",
  "United States District Court for the Eastern District of Missouri": "E.D. Mo.",
  "United States District Court for the Western District of Missouri": "W.D. Mo.",
  "United States District Court for the District of Montana": "D. Mont.",
  "United States District Court for the District of Nebraska": "D. Neb.",
  "United States District Court for the District of Nevada": "D. Nev.",
  "United States District Court for the District of New Hampshire": "D.N.H.",
  "United States District Court for the District of New Jersey": "D.N.J.",
  "United States District Court for the District of New Mexico": "D.N.M.",
  "United States District Court for the Northern District of New York": "N.D.N.Y.",
  "United States District Court for the Southern District of New York": "S.D.N.Y.",
  "United States District Court for the Eastern District of New York": "E.D.N.Y.",
  "United States District Court for the Western District of New York": "W.D.N.Y.",
  "United States District Court for the Eastern District of North Carolina": "E.D.N.C.",
  "United States District Court for the Middle District of North Carolina": "M.D.N.C.",
  "United States District Court for the Western District of North Carolina": "W.D.N.C.",
  "United States District Court for the District of North Dakota": "D.N.D.",
  "United States District Court for the Northern District of Ohio": "N.D. Ohio",
  "United States District Court for the Southern District of Ohio": "S.D. Ohio",
  "United States District Court for the Eastern District of Oklahoma": "E.D. Okla.",
  "United States District Court for the Northern District of Oklahoma": "N.D. Okla.",
  "United States District Court for the Western District of Oklahoma": "W.D. Okla.",
  "United States District Court for the District of Oregon": "D. Or.",
  "United States District Court for the Eastern District of Pennsylvania": "E.D. Pa.",
  "United States District Court for the Middle District of Pennsylvania": "M.D. Pa.",
  "United States District Court for the Western District of Pennsylvania": "W.D. Pa.",
  "United States District Court for the District of Puerto Rico": "D.P.R.",
  "United States District Court for the District of Rhode Island": "D.R.I.",
  "United States District Court for the District of South Carolina": "D.S.C.",
  "United States District Court for the District of South Dakota": "D.S.D.",
  "United States District Court for the Eastern District of Tennessee": "E.D. Tenn.",
  "United States District Court for the Middle District of Tennessee": "M.D. Tenn.",
  "United States District Court for the Western District of Tennessee": "W.D. Tenn.",
  "United States District Court for the Eastern District of Texas": "E.D. Tex.",
  "United States District Court for the Northern District of Texas": "N.D. Tex.",
  "United States District Court for the Southern District of Texas": "S.D. Tex.",
  "United States District Court for the Western District of Texas": "W.D. Tex.",
  "United States District Court for the District of Utah": "D. Utah",
  "United States District Court for the District of Vermont": "D. Vt.",
  "United States District Court for the Eastern District of Virginia": "E.D. Va.",
  "United States District Court for the Western District of Virginia": "W.D. Va.",
  "United States District Court for the Eastern District of Washington": "E.D. Wash.",
  "United States District Court for the Western District of Washington": "W.D. Wash.",
  "United States District Court for the Northern District of West Virginia": "N.D. W. Va.",
  "United States District Court for the Southern District of West Virginia": "S.D. W. Va.",
  "United States District Court for the Eastern District of Wisconsin": "E.D. Wis.",
  "United States District Court for the Western District of Wisconsin": "W.D. Wis.",
  "United States District Court for the District of Wyoming": "D. Wyo.",

  "Supreme Court of Alabama": "Ala.",
  "Supreme Court of Alaska": "Alaska",
  "Supreme Court of Arizona": "Ariz.",
  "Supreme Court of Arkansas": "Ark.",
  "Supreme Court of California": "Cal.",
  "Supreme Court of Colorado": "Colo.",
  "Supreme Court of Connecticut": "Conn.",
  "Supreme Court of Delaware": "Del.",
  "Supreme Court of Florida": "Fla.",
  "Supreme Court of Georgia": "Ga.",
  "Supreme Court of Hawaii": "Haw.",
  "Supreme Court of Idaho": "Idaho",
  "Supreme Court of Illinois": "Ill.",
  "Supreme Court of Indiana": "Ind.",
  "Supreme Court of Iowa": "Iowa",
  "Supreme Court of Kansas": "Kan.",
  "Supreme Court of Kentucky": "Ky.",
  "Supreme Court of Louisiana": "La.",
  "Supreme Court of Maine": "Me.",
  "Supreme Court of Maryland": "Md.",
  "Supreme Judicial Court of Massachusetts": "Mass.",
  "Supreme Court of Michigan": "Mich.",
  "Supreme Court of Minnesota": "Minn.",
  "Supreme Court of Mississippi": "Miss.",
  "Supreme Court of Missouri": "Mo.",
  "Supreme Court of Montana": "Mont.",
  "Supreme Court of Nebraska": "Neb.",
  "Supreme Court of Nevada": "Nev.",
  "Supreme Court of New Hampshire": "N.H.",
  "Supreme Court of New Jersey": "N.J.",
  "Supreme Court of New Mexico": "N.M.",
  "Court of Appeals of New York": "N.Y.",
  "Supreme Court of North Carolina": "N.C.",
  "Supreme Court of North Dakota": "N.D.",
  "Supreme Court of Ohio": "Ohio",
  "Supreme Court of Oklahoma": "Okla.",
  "Supreme Court of Oregon": "Or.",
  "Supreme Court of Pennsylvania": "Pa.",
  "Supreme Court of Rhode Island": "R.I.",
  "Supreme Court of South Carolina": "S.C.",
  "Supreme Court of South Dakota": "S.D.",
  "Supreme Court of Tennessee": "Tenn.",
  "Supreme Court of Texas": "Tex.",
  "Supreme Court of Utah": "Utah",
  "Supreme Court of Vermont": "Vt.",
  "Supreme Court of Virginia": "Va.",
  "Supreme Court of Washington": "Wash.",
  "Supreme Court of West Virginia": "W. Va.",
  "Supreme Court of Wisconsin": "Wis.",
  "Supreme Court of Wyoming": "Wyo."
}
